code-review/NRB_3471_3546/База_Было/Reports/СверкаОстатковЦБПоРазделамСВыписками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СверкаОстатковЦБПоРазделамСВыписками</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсточникВыписок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогВыписок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлВыписки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакРазделаБлокировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакСекцииРаздела</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакНомераРаздела</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакISIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакКоличества</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакРасширенияФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеПоОстаткам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодРаздела</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ISIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Блокировано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФайлыВыписок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерСчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВФайле</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВИмени</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Reports/СверкаОстатковЦБПоРазделамСВыписками/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, ДанныеПоОстаткам, "ДанныеПоОстаткам");
	
	Схема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрыДанных = Настройки.ПараметрыДанных;
	РазделыСчетаДепоМХ = УникальныеЗначенияКолонкиТаблицы("КодРаздела", ДанныеПоОстаткам);
	ПараметрыДанных.УстановитьЗначениеПараметра("РазделыСчетаДепоМХ", РазделыСчетаДепоМХ);
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина, , МенеджерВременныхТаблиц);
	
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.АвтоМасштаб = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УникальныеЗначенияКолонкиТаблицы(ИмяКолонки, ВнешняяТаблица)
	
	Результат = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, ВнешняяТаблица.ВыгрузитьКолонку(ИмяКолонки), Истина);
	Возврат Результат;
	
КонецФункции

Процедура СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, ВнешняяТаблица, ИмяВнешнейТаблицы)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ *
	|ПОМЕСТИТЬ " + ИмяВнешнейТаблицы + "
	|ИЗ
	|	&ВнешняяТаблица КАК ВнешняяТаблица";
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ВнешняяТаблица", ВнешняяТаблица);
	
	Запрос.Выполнить();
КонецПроцедуры

Процедура УстановитьПараметрСКД(КомпоновщикНастроек, ИмяПараметра, Значение)
	
	Перем ПараметрДанных, Настройки, ПользовательскиеНастройки, ПользовательскийПараметр;
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	ПараметрДанных = Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	
	Если ЗначениеЗаполнено(ПараметрДанных.ИдентификаторПользовательскойНастройки) Тогда
		
		ПользовательскиеНастройки = КомпоновщикНастроек.ПользовательскиеНастройки;
		ПользовательскийПараметр
			= ПользовательскиеНастройки.Элементы.Найти(ПараметрДанных.ИдентификаторПользовательскойНастройки);
		ПользовательскийПараметр.Использование = Истина;
		ПользовательскийПараметр.Значение = Значение;
	Иначе
		
		Параметр = Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
		Параметр.Использование = Истина;
		Параметр.Значение = Значение;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСтрокуВТаблицуДанныхПоОстаткам(ЭтоБлокировочныйРаздел, КодРазделаОригинал, КодРаздела, ISIN, Количество)
	
	Если ЭтоБлокировочныйРаздел = Ложь Тогда
		
		СтрокаДанных = ДанныеПоОстаткам.Добавить();
		СтрокаДанных.КодРаздела = КодРаздела;
		СтрокаДанных.Количество = Количество;
		
	Иначе
		
		СтруктураПоиска = Новый Структура("КодРаздела, ISIN", КодРазделаОригинал, ISIN);
		НайденыСтрокиДанных = ДанныеПоОстаткам.НайтиСтроки(СтруктураПоиска);
		
		Если НайденыСтрокиДанных.Количество() = 1 Тогда
			СтрокаДанных = НайденыСтрокиДанных[0];
			
		Иначе // Исключительная ситуация
			СтрокаДанных = ДанныеПоОстаткам.Добавить();
			СтрокаДанных.КодРаздела = КодРаздела;
			
			ШаблонСообщения = "ЦБ: [%1]. Для раздела блокировок: [%2] не найден раздел: [%3] !";
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ISIN, КодРаздела, КодРазделаОригинал);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли;
		
		СтрокаДанных.Блокировано = СтрокаДанных.Блокировано + Количество;
		
	КонецЕсли;
	
	СтрокаДанных.ISIN = ISIN;
	
КонецПроцедуры

Функция ДатаВФайлеВыписки(ВременноеИмяФайла, ИмяИсточникаВыписки)
	
	Период = Дата(1, 1, 1);
	
	Если ИмяИсточникаВыписки = "РДЦ" Тогда
		
		Текст = Новый ЧтениеТекста(ВременноеИмяФайла);
		ТекущаяСтрока = Текст.ПрочитатьСтроку();
		Пока ТекущаяСтрока <> Неопределено Цикл
			ТекущаяСтрока = Текст.ПрочитатьСтроку();
			
			Если СтрНайти(ТекущаяСтрока, ПризнакПериода) > 0 Тогда
				НачальныйНомер 			= СтрДлина(ПризнакПериода) + 1;
				ПериодВыпискиСтрокой 	= СокрЛП(Сред(ТекущаяСтрока, НачальныйНомер));
				Период = Дата(ПериодВыпискиСтрокой);
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		Текст.Закрыть();
		
	КонецЕсли;
	
	Если ИмяИсточникаВыписки = "КЦМФБ" Тогда
		
		Чтение = Новый ЧтениеXML;
		Чтение.ОткрытьФайл(ВременноеИмяФайла);
		
		Фабрика = Новый ФабрикаXDTO;
		ОбXDTO = Фабрика.ПрочитатьXML(Чтение);
		
		Попытка
			ОперационныйДень = ОбXDTO.Document.CtdyStmtOfHldgsV02[ПризнакПериода].StmtDtTm.Dt;
			Период = СтроковыеФункцииКлиентСерверПереопределяемый.ДатаВремяИзСтроки(ОперационныйДень);
		Исключение
			ОперационныйДень = "";
		КонецПопытки;
		
		Чтение.Закрыть();
		
	КонецЕсли;
	
	Возврат Период;
	
КонецФункции

Процедура УстановитьПутьККаталогуВыписок(ИмяОтчета, ИмяИсточникаВыписки)
	
	Попытка
		Если ИмяИсточникаВыписки = "РДЦ" Тогда
			ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.ФайловыйШлюзРДЦКаталогВыписок;
		ИначеЕсли ИмяИсточникаВыписки = "КЦМФБ" Тогда
			ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.ФайловыйШлюзКЦМФБКаталогВыписок;
		Иначе
			ТекстСообщения = СтрШаблон("Для источника '%1' загрузка не предусмотрена!", ИмяИсточникаВыписки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			ЗаписьЖурналаРегистрации(ИмяОтчета, УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		ПараметрыВнешнегоИсточника = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник);
		КаталогВыписок = ПараметрыВнешнегоИсточника.Папка;
	Исключение
		ТекстСообщения = "В данной конфигурации внешних источников по-умолчанию нет.";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

Функция ЭтоФайлВыписки(НайденныйФайл, ПараметрыФайлаВыписки, ИмяИсточникаВыписки)
	
	Если ИмяИсточникаВыписки = "РДЦ" Тогда
		
		ДлинаДаты = 6;
		ПозицияНачалаСчета 		= СтрНайти(НайденныйФайл.ИмяБезРасширения, "_", НаправлениеПоиска.СКонца, , 1) + 1;
		НомерСчета 				= Сред(НайденныйФайл.ИмяБезРасширения, ПозицияНачалаСчета);
		ПозицияНачалаДатыФайла 	= СтрНайти(НайденныйФайл.ИмяБезРасширения, "_", НаправлениеПоиска.СКонца, , 2) + 1;
		ДатаВИмениСтрокой		= Сред(НайденныйФайл.ИмяБезРасширения, ПозицияНачалаДатыФайла, ПозицияНачалаСчета - ПозицияНачалаДатыФайла - 1);
		Попытка
			ДатаВИмени = Дата("20" + Лев(ДатаВИмениСтрокой, ДлинаДаты));
		Исключение
			Возврат Ложь;
		КонецПопытки;
		ПозицияТипаФайла		= ПозицияНачалаДатыФайла + ДлинаДаты;
		ТипФайла				= ВРег(Сред(НайденныйФайл.ИмяБезРасширения, ПозицияТипаФайла, 1));
		Если Не ТипФайла = "R" Тогда
			Возврат Ложь;
		КонецЕсли;
		ДатаВФайле = ДатаВФайлеВыписки(НайденныйФайл.ПолноеИмя, ИмяИсточникаВыписки);
		
	КонецЕсли;
	
	Если ИмяИсточникаВыписки = "КЦМФБ" Тогда
		
		ДлинаДаты = 8;
		ТипФайла = НРег(Сред(НайденныйФайл.ИмяБезРасширения, 1, 4));
		Если Не ТипФайла = "rest" Тогда
			Возврат Ложь;
		КонецЕсли;
		ПозицияНачалаСчета		= СтрНайти(НайденныйФайл.ИмяБезРасширения, "_", НаправлениеПоиска.СНачала, , 1) + 1;
		ПозицияНачалаДатыФайла	= СтрНайти(НайденныйФайл.ИмяБезРасширения, "_", НаправлениеПоиска.СНачала, , 2) + 1;
		Если ПозицияНачалаСчета * ПозицияНачалаДатыФайла = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		НомерСчета				= Сред(НайденныйФайл.ИмяБезРасширения, ПозицияНачалаСчета, ПозицияНачалаДатыФайла - ПозицияНачалаСчета - 1);
		ДатаВИмениСтрокой		= Сред(НайденныйФайл.ИмяБезРасширения, ПозицияНачалаДатыФайла, ДлинаДаты);
		Попытка
			ДатаВИмени = Дата(ДатаВИмениСтрокой);
		Исключение
			Возврат Ложь;
		КонецПопытки;
		ДатаВФайле = ДатаВФайлеВыписки(НайденныйФайл.ПолноеИмя, ИмяИсточникаВыписки);
		Если ДатаВФайле = ДатаВИмени Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыФайлаВыписки.НомерСчета = НомерСчета;
	ПараметрыФайлаВыписки.ДатаВФайле = ДатаВФайле;
	ПараметрыФайлаВыписки.ДатаВИмени = ДатаВИмени;
	ПараметрыФайлаВыписки.ИмяФайла   = НайденныйФайл.ПолноеИмя;
	
	Возврат Истина;
	
КонецФункции

Функция НовыеПараметрыФайлаВыписки()
	
	Параметры = Новый Структура;
	Параметры.Вставить("НомерСчета"	, "");
	Параметры.Вставить("ДатаВФайле"	, Дата(1, 1, 1));
	Параметры.Вставить("ДатаВИмени"	, Дата(1, 1, 1));
	Параметры.Вставить("ИмяФайла"	, "");
	
	Возврат Параметры;
	
КонецФункции

Процедура ПолучитьОстаткиИзВыпискиПоИсточникуРДЦ(ВременноеИмяФайла)
	
	Текст = Новый ЧтениеТекста(ВременноеИмяФайла);
	
	ТекущаяСтрока = Текст.ПрочитатьСтроку();
	ЭтоРазделБлокировок = Ложь;
	КодРаздела = "";
	КодРазделаОригинал = "";
	Пока ТекущаяСтрока <> Неопределено Цикл
		
		ТекущаяСтрока = Текст.ПрочитатьСтроку();
		
		Если СтрНайти(ТекущаяСтрока, ПризнакСекцииРаздела) > 0 Тогда
			
			ТекущаяСтрока 	= Текст.ПрочитатьСтроку();
			НачальныйНомер 	= СтрДлина(ПризнакНомераРаздела) + 1;
			КодРаздела 		= СокрЛП(Сред(ТекущаяСтрока, НачальныйНомер));
			ЭтоРазделБлокировок = ПризнакРазделаБлокировки = Прав(КодРаздела , 1);
			Если ЭтоРазделБлокировок Тогда
				ДлинаРазделаБлокировок = СтрДлина(КодРаздела);
				КодРазделаОригинал = Сред(КодРаздела, 1, ДлинаРазделаБлокировок - 1);
			Иначе
				КодРазделаОригинал = КодРаздела;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрНайти(ТекущаяСтрока, ПризнакISIN) > 0 Тогда
			
			НачальныйНомер 	= СтрДлина(ПризнакISIN) + 1;
			ISIN 			= СокрЛП(Сред(ТекущаяСтрока, НачальныйНомер));
			ТекущаяСтрока 	= Текст.ПрочитатьСтроку();
			ТекущаяСтрока	= СтрЗаменить(ТекущаяСтрока, "," , " ");
			НачальныйНомер 	= СтрДлина(ПризнакКоличества) + 1;
			КоличествоСтр 	= СокрЛП(Сред(ТекущаяСтрока, НачальныйНомер));
			Количество 		= СтроковыеФункцииКлиентСервер.СтрокаВЧисло(КоличествоСтр);
			
			ДобавитьСтрокуВТаблицуДанныхПоОстаткам(ЭтоРазделБлокировок, КодРазделаОригинал, КодРаздела, ISIN, Количество);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Текст.Закрыть();
	
КонецПроцедуры

Процедура ПолучитьОстаткиИзВыпискиПоИсточникуКЦМФБ(ВременноеИмяФайла)
	
	Чтение = Новый ЧтениеXML;
	Чтение.ОткрытьФайл(ВременноеИмяФайла);
	
	Фабрика = Новый ФабрикаXDTO;
	ОбXDTO = Фабрика.ПрочитатьXML(Чтение);
	
	CtdyStmtOfHldgsV02 = ОбXDTO.Document.CtdyStmtOfHldgsV02;
	
	ЭтоРазделБлокировок = Ложь;
	КодРаздела = "";
	КодРазделаОригинал = "";
	
	ЭтоКоллекцияРазделов = ТипЗнч(CtdyStmtOfHldgsV02[ПризнакНомераРаздела]) = Тип("СписокXDTO");
	Если ЭтоКоллекцияРазделов Тогда
		КоличествоРазделов = CtdyStmtOfHldgsV02[ПризнакНомераРаздела].Количество();
	Иначе
		КоличествоРазделов = 1;
	КонецЕсли;
	Для ИндексРаздела = 0 По КоличествоРазделов - 1 Цикл
		
		Если ЭтоКоллекцияРазделов Тогда
			SubAcctDtls = CtdyStmtOfHldgsV02[ПризнакНомераРаздела][ИндексРаздела];
		Иначе
			SubAcctDtls = CtdyStmtOfHldgsV02[ПризнакНомераРаздела];
		КонецЕсли;
		КодРаздела = СокрЛП(SubAcctDtls.Id.SmplId.Prtry.Id);
		КодРазделаОригинал = КодРаздела;
		
		ЕстьОстатки = SubAcctDtls.Свойства().Получить(ПризнакСекцииРаздела) <> Неопределено;
		Если ЕстьОстатки Тогда
			
			ДобавитьОстаткиИзВыпискиПоИсточникуКЦМФБвТаблицу(SubAcctDtls, ЭтоРазделБлокировок, КодРазделаОригинал, КодРаздела);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Чтение.Закрыть();
	
КонецПроцедуры

Процедура ДобавитьОстаткиИзВыпискиПоИсточникуКЦМФБвТаблицу(SubAcctDtls, ЭтоРазделБлокировок, КодРазделаОригинал, КодРаздела)
	
	ЭтоКоллекцияЦБ = ТипЗнч(SubAcctDtls[ПризнакСекцииРаздела]) = Тип("СписокXDTO");
	Если ЭтоКоллекцияЦБ Тогда
		КоличествоЦБ = SubAcctDtls[ПризнакСекцииРаздела].Количество();
	Иначе
		КоличествоЦБ = 1;
	КонецЕсли;
	
	Для ИндексЦБ = 0 По КоличествоЦБ - 1 Цикл
		
		Если ЭтоКоллекцияЦБ Тогда
			BalForSubAcct = SubAcctDtls[ПризнакСекцииРаздела][ИндексЦБ];
		Иначе
			BalForSubAcct = SubAcctDtls[ПризнакСекцииРаздела];
		КонецЕсли;
		
		ISIN 			= СокрЛП(BalForSubAcct[ПризнакISIN].Id.ISIN);
		КоличествоСтр 	= СокрЛП(BalForSubAcct[ПризнакКоличества].Qty.Unit);
		Количество 		= СтроковыеФункцииКлиентСервер.СтрокаВЧисло(КоличествоСтр);
		
		ДобавитьСтрокуВТаблицуДанныхПоОстаткам(ЭтоРазделБлокировок, КодРазделаОригинал, КодРаздела, ISIN, Количество);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Инициализация по умолчанию
//
// Параметры:
//  ИмяОтчета			 - Строка - Название отчета
//  ИмяИсточникаВыписки	 - Строка - Название источника выписки
//
Процедура ИнициализацияПоУмолчанию(ИмяОтчета, ИмяИсточникаВыписки) Экспорт
	
	ИсточникВыписок = ИмяИсточникаВыписки;
	
	Если ИмяИсточникаВыписки = "РДЦ" Тогда
		ПризнакРазделаБлокировки 	= "P";
		ПризнакСекцииРаздела 		= ":16R:SUBSAFE";
		ПризнакНомераРаздела 		= ":97A::SAFE//";
		ПризнакISIN 				= ":35B:ISIN";
		ПризнакКоличества 			= ":93B::AGGR//UNIT/";
		ПризнакПериода	 			= ":98A::STAT//";
		ПризнакРасширенияФайла	 	= "txt";
	КонецЕсли;
	Если ИмяИсточникаВыписки = "КЦМФБ" Тогда
		ПризнакРазделаБлокировки 	= "";
		ПризнакСекцииРаздела 		= "BalForSubAcct";
		ПризнакНомераРаздела 		= "SubAcctDtls";
		ПризнакISIN 				= "FinInstrmDtls";
		ПризнакКоличества 			= "AggtQty";
		ПризнакПериода	 			= "StmtGnlDtls";
		ПризнакРасширенияФайла	 	= "xml";
	КонецЕсли;
	
	УстановитьПутьККаталогуВыписок(ИмяОтчета, ИмяИсточникаВыписки);
	
КонецПроцедуры

// Процедура - Сохранить настройки
//
// Параметры:
//  ИмяОтчета			 - Строка - Название отчета
//  ИмяИсточникаВыписки	 - Строка - Название источника выписки
//
Процедура СохранитьНастройки(ИмяОтчета, ИмяИсточникаВыписки) Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ПризнакРазделаБлокировки"	, ПризнакРазделаБлокировки);
	СтруктураПараметров.Вставить("ПризнакСекцииРаздела"		, ПризнакСекцииРаздела);
	СтруктураПараметров.Вставить("ПризнакНомераРаздела"		, ПризнакНомераРаздела);
	СтруктураПараметров.Вставить("ПризнакISIN"				, ПризнакISIN);
	СтруктураПараметров.Вставить("ПризнакКоличества"		, ПризнакКоличества);
	СтруктураПараметров.Вставить("ПризнакПериода"			, ПризнакПериода);
	СтруктураПараметров.Вставить("КаталогВыписок"			, КаталогВыписок);
	СтруктураПараметров.Вставить("ПризнакРасширенияФайла"	, ПризнакРасширенияФайла);
	
	ХранилищеОбщихНастроек.Сохранить(ИмяОтчета , "СтруктураПараметров" + ИмяИсточникаВыписки , СтруктураПараметров);
	
КонецПроцедуры

// Процедура - Восстановить настройки
//
// Параметры:
//  ИмяОтчета			 - Строка - Название отчета
//  ИмяИсточникаВыписки	 - Строка - Название источника выписки
//
Процедура ВосстановитьНастройки(ИмяОтчета, ИмяИсточникаВыписки) Экспорт
	
	СтруктураПараметров = ХранилищеОбщихНастроек.Загрузить(ИмяОтчета , "СтруктураПараметров" + ИмяИсточникаВыписки);
	
	Если СтруктураПараметров <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураПараметров);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Получить остатки из выписки
//
//  Информация о настройках ключевых точек файла источника "РДЦ"
//  	"P" - последний символ раздела, означает что это блокировка Раздела, с таким же номером, но без "P" в конце
//  	":16R:SUBSAFE" - начало секции Раздела счета депо МХ, в следующей строке будет:
//  	":97A::SAFE//" - за этим текстом идет номер Раздела
//  	В каждом разделе идут ценные бумаги:
//  	":35B:ISIN" - за этим текстом идет ISIN, в следующей строке будет:
//  	":93B::AGGR//UNIT/" - за этим текстом идет количество  (до символа ",")
//
//  Информация о настройках ключевых точек файла источника "КЦМФБ"
// 		Document.CtdyStmtOfHldgsV02 -обязательный тег
//  	в нем:
//  	 - <MsgId>       - обязательный тег в котором есть <CreDtTm>  2021-07-19T11:12:32.490   : дата выписки
//  	 - <StmtGnlDtls> - обязательный тег в котором есть  <StmtDtTm><Dt>2021-07-16</Dt>       : опер день
//  	   берем только Выписки, в которых Дата выписки отличается от Даты опер.дня 
//  	 - <AcctDtls>    - обязательный тег в котором есть: <Id><SmplId><Prtry><Id>RMM00511</Id>  - НомерСчета !
//  	 - <SubAcctDtls>: массив субсчетов, в котором есть:
//  	        - <Id><SmplId><Prtry><Id>RMM00511</Id>  - НомерРаздела !
//  	        - <BalForSubAcct> : нет, или 1 (тогда это структура) или >1 (тогда это массив структур)  , в котором есть:
//  	              - <AggtQty>      -    обязательный тег <Qty><Unit>1.00000000</Unit></Qty> - количество штук
//  	              - <AvlblQty>     - НЕ обязательный тег <Qty><Unit>1.00000000</Unit></Qty> - количество штук доступно
//  	              - <FinInstrmDtls>-    обязательный тег <Id><ISIN>XS0088543193</ISIN></Id> - ISIN ЦБ
//
// Параметры:
//  ФайлВХранилище		 - Строка	 - Адрес хранилища с файлом выписки
//  ИмяИсточникаВыписки	 - Строка	 - Название источника выписки
//
Процедура ПолучитьОстаткиИзВыписки(ФайлВХранилище, ИмяИсточникаВыписки) Экспорт
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(ФайлВХранилище);
	ВременноеИмяФайла = ПолучитьИмяВременногоФайла(ПризнакРасширенияФайла);
	ДвоичныеДанные.Записать(ВременноеИмяФайла);
	
	ДанныеПоОстаткам.Очистить();
	
	Если ИмяИсточникаВыписки = "РДЦ" Тогда
		ПолучитьОстаткиИзВыпискиПоИсточникуРДЦ(ВременноеИмяФайла);
	КонецЕсли;
	
	Если ИмяИсточникаВыписки = "КЦМФБ" Тогда
		ПолучитьОстаткиИзВыпискиПоИсточникуКЦМФБ(ВременноеИмяФайла);
	КонецЕсли;
	
	Если ДанныеПоОстаткам.Количество() = 0 Тогда
		ТекстСообщения = "Данные для загрузки не обнаружены. Попробуйте другой файл (с секциями вида [" + ПризнакСекцииРаздела + "]).";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Период = ДатаВФайлеВыписки(ВременноеИмяФайла, ИмяИсточникаВыписки);
	УстановитьПараметрСКД(КомпоновщикНастроек, "Период", Период);
	УстановитьПараметрСКД(КомпоновщикНастроек, "ИсточникВыписок", ИмяИсточникаВыписки);
	
	УдалитьФайлы(ВременноеИмяФайла);
	
КонецПроцедуры

// Процедура - Получить файлы выписки
//
// Параметры:
//  Каталог				 - Строка	 - Каталог файлов выписки
//  ИмяИсточникаВыписки	 - Строка - Название источника выписки
//
Процедура ПолучитьФайлыВыписки(Каталог, ИмяИсточникаВыписки) Экспорт
	
	ФайлыВыписок.Очистить();
	
	НайденныеФайлы = НайтиФайлы(Каталог, "*." + ПризнакРасширенияФайла, Истина);
	
	Для Каждого НайденныйФайл Из НайденныеФайлы Цикл
		
		ПараметрыФайлаВыписки = НовыеПараметрыФайлаВыписки();
		
		Если ЭтоФайлВыписки(НайденныйФайл, ПараметрыФайлаВыписки, ИмяИсточникаВыписки) Тогда
			
			НовыйФайл = ФайлыВыписок.Добавить();
			
			ЗаполнитьЗначенияСвойств(НовыйФайл, ПараметрыФайлаВыписки);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ФайлыВыписок.Сортировать("ДатаВИмени УБЫВ, НомерСчета");
	
КонецПроцедуры

#КонецОбласти
